rims-lab-quantum/service.log

541  [main] INFO  c.i.r.l.q.SpringBootLabQuantumApplication - Starting SpringBootLabQuantumApplication on LAPTOP-J5VT00AT with PID 13600 (E:\Works\workspace\lab\rims-lab-quantum\target\classes started by HUY in E:\Works\workspace\lab\rims-lab-quantum)
545  [main] INFO  c.i.r.l.q.SpringBootLabQuantumApplication - No active profile set, falling back to default profiles: default
2035 [main] INFO  o.a.catalina.core.StandardService - Starting service [Tomcat]
2037 [main] INFO  o.a.catalina.core.StandardEngine - Starting Servlet Engine: Apache Tomcat/8.5.15
2149 [localhost-startStop-1] INFO  o.a.c.c.C.[Tomcat].[localhost].[/] - Initializing Spring embedded WebApplicationContext
2308 [localhost-startStop-1] WARN  o.s.b.c.p.ConfigurationPropertiesBindingPostProcessor - The @ConfigurationProperties bean class org.apache.cxf.spring.boot.autoconfigure.CxfProperties contains validation constraints but had not been annotated with @Validated.
2309 [localhost-startStop-1] WARN  o.s.b.c.p.ConfigurationPropertiesBindingPostProcessor - The @ConfigurationProperties bean class org.apache.cxf.spring.boot.autoconfigure.CxfProperties contains validation constraints but had not been annotated with @Validated.
2309 [localhost-startStop-1] WARN  o.s.b.c.p.ConfigurationPropertiesBindingPostProcessor - The @ConfigurationProperties bean class org.apache.cxf.spring.boot.autoconfigure.CxfProperties contains validation constraints but had not been annotated with @Validated.
2766 [main] INFO  o.a.c.w.s.f.ReflectionServiceFactoryBean - Creating Service {http://tempuri.org/}LISIntegrationWebserviceSoapService from class org.tempuri.LISIntegrationWebserviceSoap
4329 [main] INFO  o.a.c.s.L.L.LISIntegrationWebserviceSoap - Outbound Message:
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.connectors.connect.mirth.com">
  <soap:Body>
    <GetReportPDF xmlns="http://tempuri.org/">
      <OrderNo>0001</OrderNo>
      <userName>RenalTeam</userName>
      <password>renal@123</password>
    </GetReportPDF></soap:Body></soap:Envelope>
5025 [main] INFO  o.a.c.s.L.L.LISIntegrationWebserviceSoap - Outbound Message:
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.connectors.connect.mirth.com">
  <soap:Body>
    <PushOrder xmlns="http://tempuri.org/">
      <ws:acceptMessage>

        <arg0>

          <content>
            <MSG>
    
              <MSH>
        
                <Sending_Application>Third Party</Sending_Application>
        
                <Sending_Facility>JJJ</Sending_Facility>
        
                <Receiving_Application>LIS</Receiving_Application>
        
                <Receiving_Facility>JJJ</Receiving_Facility>
        
                <Message_Date_Time>20160227084606</Message_Date_Time>
        
                <Message_Type>ORM</Message_Type>
        
                <Message_Control_Id>877652</Message_Control_Id>
    
              </MSH>
    
              <EVN>
        
                <Event_Type_Code>O01</Event_Type_Code>
        
                <Recorded_DateTime>20160227084606</Recorded_DateTime>
    
              </EVN>
    
              <PID>
        
                <Patient_Id_Ext/>
        
                <Patient_Id_Int>JJJ87878787</Patient_Id_Int>
        
                <Patient_Id_Type>NEW IC</Patient_Id_Type>
        
                <Patient_Id_Number>510915105063</Patient_Id_Number>
        
                <Patient_Name>Abraham</Patient_Name>
        
                <Date_Of_Birth>19510915</Date_Of_Birth>
        
                <Gender_Code>M</Gender_Code>
        
                <Race_code>MALAYSIA</Race_code>
        
                <Address1>NO 5</Address1>
        
                <Address2> TMN LUYANG PHASE </Address2>
        
                <Address3/>
        
                <City/>
        
                <State/>
        
                <Postal_Code>883400</Postal_Code>
        
                <Country_Code>MALAYSIA</Country_Code>
        
                <Phone_Home/>
        
                <Phone_Mobile/>
        
                <Phone_Business>0198202090</Phone_Business>
        
                <Primary_Language/>
        
                <Marital_Status_Code>MARRIED</Marital_Status_Code>
        
                <Religion_Code>OTHERS</Religion_Code>
        
                <Nationality_Code>MALAYSIA</Nationality_Code>
    
              </PID>
    
              <PV1>
        
                <Patient_Type_Code>ED</Patient_Type_Code>
        
                <Ward_Code/>
        
                <Admission_Type/>
        
                <Preadmit_Number/>
        
                <Specialty_Code>SP_19</Specialty_Code>
        
                <Attending_Doctor_Code/>
        
                <Attending_Doctor_Desc/>
        
                <Referring_Doctor_Code/>
        
                <Referring_Doctor_Desc/>
        
                <Consulting_Doctor_Code/>
        
                <Consulting_Doctor_Desc/>
        
                <Admitting_Doctor_Code>WRJFF</Admitting_Doctor_Code>
        
                <Admitting_Doctor_Desc>WRJFF</Admitting_Doctor_Desc>
        
                <Patient_Class/>
        
                <Visit_Number>16ED00001102</Visit_Number>
        
                <Financial_Class_Code>NA</Financial_Class_Code>
        
                <Admit_DateTime>20160227080600</Admit_DateTime>
    
              </PV1>
    
              <ORC>
        
                <Order_Control>NW</Order_Control>
        
                <ORC_Placer_Order_Number>16017259</ORC_Placer_Order_Number>
        
                <ORC_Filler_Order_Number/>
        
                <Placer_Group_Number/>
        
                <Order_Status_Code/>
        
                <Response_Flag/>
        
                <ORC_Quantity_Timing/>
        
                <Parent/>
        
                <DateTime_Of_Transaction/>
        
                <Entered_By_ID/>
        
                <Entered_By_Name/>
        
                <Verified_By_ID/>
        
                <Verified_By_Name/>
        
                <ORC_Ordering_Provider_ID>WRJFF</ORC_Ordering_Provider_ID>
        
                <ORC_Ordering_Provider_Name>DR Isanth Kumar</ORC_Ordering_Provider_Name>
        
                <Enter_Location/>
        
                <Call_Back_Phone_Number/>
        
                <Order_Effective_DateTime/>
        
                <Order_Control_Code_Reason/>
        
                <Entering_Organization/>
        
                <Entering_Device/>
        
                <Action_By/>
        
                <Advanced_Beneficiary_Notice_Code/>
        
                <Ordering_Facility_Code/>
        
                <Ordering_Facility_Name/>
    
              </ORC>
    
              <Observation_Request>
        
                <OBR>
            
                  <Set_Id_OBR>1</Set_Id_OBR>
            
                  <OBR_Placer_Order_Number>218228</OBR_Placer_Order_Number>
            
                  <OBR_Filler_Order_Number/>
            
                  <Package_Code/>
            
                  <Package_Description/>
            
                  <Test_Code>P.QDN</Test_Code>
            
                  <Test_Name>QDN - Quantum General Screen</Test_Name>
            
                  <Priority_Code/>
            
                  <Priority_Desc/>
            
                  <Requested_DateTime>20160227084605</Requested_DateTime>
            
                  <Observation_DateTime/>
            
                  <Observation_End_DateTime/>
            
                  <Collection_Volume/>
            
                  <Collector_Identifier/>
            
                  <Specimen_Action_Code/>
            
                  <Danger_Code/>
            
                  <Relevant_Clinical_Info/>
            
                  <Specimen_Received_DateTime/>
            
                  <Specimen_Source_Code/>
            
                  <Specimen_Source_Desc/>
            
                  <OBR_Ordering_Provider_ID>WRJFF</OBR_Ordering_Provider_ID>
            
                  <OBR_Ordering_Provider_Name>DR Ishant Kumar</OBR_Ordering_Provider_Name>
            
                  <Order_Callback_Phone_Number/>
            
                  <Placer_Field1>LAB</Placer_Field1>
            
                  <Placer_Field2>LAB</Placer_Field2>
            
                  <Filler_Field1/>
            
                  <Filler_Field2/>
            
                  <Status_Change_DateTime/>
            
                  <Charge_To_Practice/>
            
                  <Diagnostic_Serv_Sect_Code>GENERALSCREENS</Diagnostic_Serv_Sect_Code>
            
                  <Diagnostic_Serv_Sect_Desc>GENERAL SCREENS</Diagnostic_Serv_Sect_Desc>
            
                  <Result_Status/>
            
                  <Parent_Result/>
            
                  <OBR_Quantity_Timing>1.00</OBR_Quantity_Timing>
            
                  <Unit_Code>UN</Unit_Code>
            
                  <Unit_Desc/>
            
                  <Result_Copies_To/>
            
                  <Transportation_Mode/>
            
                  <Reason_For_Study/>
            
                  <Principal_Result_Interpreter/>
            
                  <Assistant_Result_Interpreter/>
            
                  <Technician/>
            
                  <Transcriptionist/>
            
                  <Scheduled_DateTime/>
            
                  <Number_Of_Sample_Containers/>
            
                  <Transport_Logistics_Of_Collected_Sample/>
            
                  <Collector_Comment/>
            
                  <Transport_Arrangement_Responsibility/>
            
                  <Transport_Arranged/>
            
                  <Escort_Required/>
            
                  <Planned_Patient_Transport_Comment/>
            
                  <Procedure_Code/>
            
                  <Procedure_Code_Modifier/>
            
                  <Placer_Supplemental_Service/>
            
                  <Filler_Supplemental_Service/>
            
                  <Cancel_Reason_Code/>
            
                  <Cancel_Reason_Desc/>
        
                </OBR>
    
              </Observation_Request>

            </MSG>

          </content>

        </arg0>

      </ws:acceptMessage>
      <userName>RenalTeam</userName>
      <password>renal@123</password>
    </PushOrder></soap:Body></soap:Envelope>
65036 [main] WARN  org.apache.cxf.endpoint.ClientImpl - Timed out waiting for response to operation {http://tempuri.org/}PushOrder.
65085 [main] ERROR o.s.boot.SpringApplication - Application startup failed
java.lang.IllegalStateException: Failed to execute CommandLineRunner
	at org.springframework.boot.SpringApplication.callRunner(SpringApplication.java:735)
	at org.springframework.boot.SpringApplication.callRunners(SpringApplication.java:716)
	at org.springframework.boot.SpringApplication.afterRefresh(SpringApplication.java:703)
	at org.springframework.boot.SpringApplication.run(SpringApplication.java:304)
	at org.springframework.boot.SpringApplication.run(SpringApplication.java:1118)
	at org.springframework.boot.SpringApplication.run(SpringApplication.java:1107)
	at com.iis.rims.lab.quantum.SpringBootLabQuantumApplication.main(SpringBootLabQuantumApplication.java:21)
Caused by: javax.xml.ws.soap.SOAPFaultException: Timed out waiting for response to operation {http://tempuri.org/}PushOrder.
	at org.apache.cxf.jaxws.JaxWsClientProxy.invoke(JaxWsClientProxy.java:161)
	at com.sun.proxy.$Proxy89.pushOrder(Unknown Source)
	at com.iis.rims.lab.quantum.SpringBootLabQuantumApplication$1.run(SpringBootLabQuantumApplication.java:42)
	at org.springframework.boot.SpringApplication.callRunner(SpringApplication.java:732)
	... 6 common frames omitted
Caused by: java.io.IOException: Timed out waiting for response to operation {http://tempuri.org/}PushOrder.
	at org.apache.cxf.endpoint.ClientImpl.waitResponse(ClientImpl.java:689)
	at org.apache.cxf.endpoint.ClientImpl.processResult(ClientImpl.java:612)
	at org.apache.cxf.endpoint.ClientImpl.doInvoke(ClientImpl.java:523)
	at org.apache.cxf.endpoint.ClientImpl.invoke(ClientImpl.java:423)
	at org.apache.cxf.endpoint.ClientImpl.invoke(ClientImpl.java:324)
	at org.apache.cxf.endpoint.ClientImpl.invoke(ClientImpl.java:277)
	at org.apache.cxf.frontend.ClientProxy.invokeSync(ClientProxy.java:96)
	at org.apache.cxf.jaxws.JaxWsClientProxy.invoke(JaxWsClientProxy.java:139)
	... 9 common frames omitted
